perfTest/stage3/put_sync.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.53ms    9.10ms  40.83ms   84.64%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    2.21ms
 90.000%   21.82ms
 99.000%   35.01ms
 99.900%   39.74ms
 99.990%   40.86ms
 99.999%   40.86ms
100.000%   40.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.105     0.000000            1         1.00
       0.616     0.100000          962         1.11
       0.819     0.200000         1927         1.25
       1.012     0.300000         2887         1.43
       1.204     0.400000         3853         1.67
       1.389     0.500000         4811         2.00
       1.489     0.550000         5290         2.22
       1.596     0.600000         5772         2.50
       1.718     0.650000         6253         2.86
       1.892     0.700000         6734         3.33
       2.213     0.750000         7214         4.00
       3.019     0.775000         7454         4.44
       9.287     0.800000         7696         5.00
      13.143     0.825000         7937         5.71
      14.775     0.850000         8176         6.67
      17.695     0.875000         8417         8.00
      19.711     0.887500         8536         8.89
      21.855     0.900000         8657        10.00
      23.855     0.912500         8778        11.43
      25.455     0.925000         8897        13.33
      27.199     0.937500         9018        16.00
      28.063     0.943750         9077        17.78
      28.927     0.950000         9138        20.00
      29.663     0.956250         9200        22.86
      30.399     0.962500         9258        26.67
      31.135     0.968750         9319        32.00
      31.583     0.971875         9348        35.56
      32.159     0.975000         9379        40.00
      32.831     0.978125         9408        45.71
      33.535     0.981250         9438        53.33
      34.047     0.984375         9469        64.00
      34.271     0.985938         9485        71.11
      34.527     0.987500         9498        80.00
      34.879     0.989062         9514        91.43
      35.167     0.990625         9529       106.67
      35.487     0.992188         9544       128.00
      35.679     0.992969         9551       142.22
      35.871     0.993750         9558       160.00
      36.095     0.994531         9566       182.86
      36.511     0.995313         9573       213.33
      36.863     0.996094         9581       256.00
      37.023     0.996484         9585       284.44
      37.343     0.996875         9588       320.00
      37.823     0.997266         9592       365.71
      38.271     0.997656         9596       426.67
      38.655     0.998047         9600       512.00
      39.071     0.998242         9602       568.89
      39.135     0.998437         9603       640.00
      39.519     0.998633         9605       731.43
      39.679     0.998828         9607       853.33
      39.967     0.999023         9609      1024.00
      40.031     0.999121         9610      1137.78
      40.063     0.999219         9611      1280.00
      40.191     0.999316         9612      1462.86
      40.415     0.999414         9614      1706.67
      40.415     0.999512         9614      2048.00
      40.415     0.999561         9614      2275.56
      40.639     0.999609         9616      2560.00
      40.639     0.999658         9616      2925.71
      40.639     0.999707         9616      3413.33
      40.639     0.999756         9616      4096.00
      40.639     0.999780         9616      4551.11
      40.863     0.999805         9618      5120.00
      40.863     1.000000         9618          inf
#[Mean    =        5.528, StdDeviation   =        9.095]
#[Max     =       40.832, Total count    =         9618]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9669 requests in 10.24s, 632.64KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
Requests/sec:    944.41
Transfer/sec:     61.79KB